app/controllers/articles_controller.rb

INSERT INTO "articles" ("name", "description", "link", "user_id") VALUES (?, ?, ?, ?)  [["name", "Test article"], ["description", "This study proves that article submission works"], ["link", "www.google.com"], ["user_id", 7]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "description" = ?, "user_id" = ? WHERE "articles"."id" = ?
---
  def update
    respond_to do |format|
      if @article.update(article_params)