app/controllers/departments_controller.rb

  def show

  	@params = params[:id]
  	@articles = Article.all.collect {|article| next if article.user.department.id != params[:id].to_i
---
SELECT  "articles".* FROM "articles" WHERE "articles"."department_id" = ? LIMIT ?  [["department_id", "1"], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]